/* automatically generated by rust-bindgen */

#![allow(non_upper_case_globals,non_snake_case,non_camel_case_types)]
extern crate ipp_ctypes;

pub const IPP_VERSION_MAJOR: ipp_ctypes::c_uint = 2017;
pub const IPP_VERSION_MINOR: ipp_ctypes::c_uint = 0;
pub const IPP_VERSION_UPDATE: ipp_ctypes::c_uint = 3;
pub const IPP_VERSION_STR: &'static [u8; 9usize] = b"2017.0.3\x00";
pub const IPP_PI: f64 = 3.141592653589793;
pub const IPP_2PI: f64 = 6.283185307179586;
pub const IPP_PI2: f64 = 1.5707963267948966;
pub const IPP_PI4: f64 = 0.7853981633974483;
pub const IPP_PI180: f64 = 0.017453292519943295;
pub const IPP_RPI: f64 = 0.3183098861837907;
pub const IPP_SQRT2: f64 = 1.4142135623730951;
pub const IPP_SQRT3: f64 = 1.7320508075688772;
pub const IPP_LN2: f64 = 0.6931471805599453;
pub const IPP_LN3: f64 = 1.0986122886681098;
pub const IPP_E: f64 = 2.718281828459045;
pub const IPP_RE: f64 = 0.36787944117144233;
pub const IPP_MAX_8U: ipp_ctypes::c_uint = 255;
pub const IPP_MAX_16U: ipp_ctypes::c_uint = 65535;
pub const IPP_MAX_32U: ipp_ctypes::c_uint = 4294967295;
pub const IPP_MIN_8U: ipp_ctypes::c_uint = 0;
pub const IPP_MIN_16U: ipp_ctypes::c_uint = 0;
pub const IPP_MIN_32U: ipp_ctypes::c_uint = 0;
pub const IPP_MIN_8S: ipp_ctypes::c_int = -128;
pub const IPP_MAX_8S: ipp_ctypes::c_uint = 127;
pub const IPP_MIN_16S: ipp_ctypes::c_int = -32768;
pub const IPP_MAX_16S: ipp_ctypes::c_uint = 32767;
pub const IPP_MIN_32S: ipp_ctypes::c_int = -2147483648;

pub const ippCPUID_MOVBE: ipp_ctypes::c_uint = 32;
pub const ippCPUID_SSE41: ipp_ctypes::c_uint = 64;
pub const ippCPUID_SSE42: ipp_ctypes::c_uint = 128;
pub const ippCPUID_AVX: ipp_ctypes::c_uint = 256;
pub const ippAVX_ENABLEDBYOS: ipp_ctypes::c_uint = 512;
pub const ippCPUID_AES: ipp_ctypes::c_uint = 1024;
pub const ippCPUID_CLMUL: ipp_ctypes::c_uint = 2048;
pub const ippCPUID_ABR: ipp_ctypes::c_uint = 4096;
pub const ippCPUID_RDRAND: ipp_ctypes::c_uint = 8192;
pub const ippCPUID_F16C: ipp_ctypes::c_uint = 16384;
pub const ippCPUID_AVX2: ipp_ctypes::c_uint = 32768;
pub const ippCPUID_ADCOX: ipp_ctypes::c_uint = 65536;
pub const ippCPUID_RDSEED: ipp_ctypes::c_uint = 131072;
pub const ippCPUID_PREFETCHW: ipp_ctypes::c_uint = 262144;
pub const ippCPUID_SHA: ipp_ctypes::c_uint = 524288;
pub const ippCPUID_AVX512F: ipp_ctypes::c_uint = 1048576;
pub const ippCPUID_AVX512CD: ipp_ctypes::c_uint = 2097152;
pub const ippCPUID_AVX512ER: ipp_ctypes::c_uint = 4194304;
pub const ippCPUID_AVX512PF: ipp_ctypes::c_uint = 8388608;
pub const ippCPUID_AVX512BW: ipp_ctypes::c_uint = 16777216;
pub const ippCPUID_AVX512DQ: ipp_ctypes::c_uint = 33554432;
pub const ippCPUID_AVX512VL: ipp_ctypes::c_uint = 67108864;
pub const ippCPUID_AVX512VBMI: ipp_ctypes::c_uint = 134217728;
pub const ippCPUID_MPX: ipp_ctypes::c_uint = 268435456;
pub const ippCPUID_AVX512_4FMADDPS: ipp_ctypes::c_uint = 536870912;
pub const ippCPUID_AVX512_4VNNIW: ipp_ctypes::c_uint = 1073741824;
pub const ippCPUID_KNC: ipp_ctypes::c_uint = 2147483648;
pub const ippCPUID_NOCHECK: ipp_ctypes::c_longlong = -9223372036854775808;
pub const ippCPUID_GETINFO_A: ipp_ctypes::c_ulonglong = 7020942968495564135;
pub const IPP_TEMPORAL_COPY: ipp_ctypes::c_uint = 0;
pub const IPP_NONTEMPORAL_STORE: ipp_ctypes::c_uint = 1;
pub const IPP_NONTEMPORAL_LOAD: ipp_ctypes::c_uint = 2;
pub const IPP_HOG_MAX_CELL: ipp_ctypes::c_uint = 16;
pub const IPP_HOG_MAX_BLOCK: ipp_ctypes::c_uint = 64;
pub const IPP_HOG_MAX_BINS: ipp_ctypes::c_uint = 16;
pub const IPP_SEGMENT_QUEUE: ipp_ctypes::c_uint = 1;
pub const IPP_SEGMENT_DISTANCE: ipp_ctypes::c_uint = 2;
pub const IPP_SEGMENT_BORDER_4: ipp_ctypes::c_uint = 64;
pub const IPP_SEGMENT_BORDER_8: ipp_ctypes::c_uint = 128;
pub const khdtv0f: f64 = 0.2126;
pub const khdtv1f: f64 = 0.7152;
pub const khdtv2f: f64 = 0.0722;
pub const khdtv3f: f64 = 0.1146;
pub const khdtv4f: f64 = 0.3854;
pub const khdtv5f: f64 = 0.5;
pub const khdtv6f: f64 = 0.4542;
pub const khdtv7f: f64 = 0.0458;
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppLibraryVersion {
    pub major: ipp_ctypes::c_int,
    pub minor: ipp_ctypes::c_int,
    pub majorBuild: ipp_ctypes::c_int,
    pub build: ipp_ctypes::c_int,
    pub targetCpu: [ipp_ctypes::c_char; 4usize],
    pub Name: *const ipp_ctypes::c_char,
    pub Version: *const ipp_ctypes::c_char,
    pub BuildDate: *const ipp_ctypes::c_char,
}
#[test]
fn bindgen_test_layout_IppLibraryVersion() {
    assert_eq!(::std::mem::size_of::<IppLibraryVersion>() , 48usize , concat !
               ( "Size of: " , stringify ! ( IppLibraryVersion ) ));
    assert_eq! (::std::mem::align_of::<IppLibraryVersion>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( IppLibraryVersion ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLibraryVersion ) ) . major as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLibraryVersion ) ,
                "::" , stringify ! ( major ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLibraryVersion ) ) . minor as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLibraryVersion ) ,
                "::" , stringify ! ( minor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLibraryVersion ) ) . majorBuild as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLibraryVersion ) ,
                "::" , stringify ! ( majorBuild ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLibraryVersion ) ) . build as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLibraryVersion ) ,
                "::" , stringify ! ( build ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLibraryVersion ) ) . targetCpu as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLibraryVersion ) ,
                "::" , stringify ! ( targetCpu ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLibraryVersion ) ) . Name as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLibraryVersion ) ,
                "::" , stringify ! ( Name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLibraryVersion ) ) . Version as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLibraryVersion ) ,
                "::" , stringify ! ( Version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLibraryVersion ) ) . BuildDate as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLibraryVersion ) ,
                "::" , stringify ! ( BuildDate ) ));
}
impl Clone for IppLibraryVersion {
    fn clone(&self) -> Self { *self }
}
pub type Ipp8u = ipp_ctypes::c_uchar;
pub type Ipp16u = ipp_ctypes::c_ushort;
pub type Ipp32u = ipp_ctypes::c_uint;
pub type Ipp8s = ipp_ctypes::c_schar;
pub type Ipp16s = ipp_ctypes::c_short;
pub type Ipp32s = ipp_ctypes::c_int;
pub type Ipp32f = f32;
pub type Ipp64s = ipp_ctypes::c_longlong;
pub type Ipp64u = ipp_ctypes::c_ulonglong;
pub type Ipp64f = f64;
pub type Ipp16f = Ipp16s;
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct Ipp8sc {
    pub re: Ipp8s,
    pub im: Ipp8s,
}
#[test]
fn bindgen_test_layout_Ipp8sc() {
    assert_eq!(::std::mem::size_of::<Ipp8sc>() , 2usize , concat ! (
               "Size of: " , stringify ! ( Ipp8sc ) ));
    assert_eq! (::std::mem::align_of::<Ipp8sc>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( Ipp8sc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp8sc ) ) . re as * const _ as usize } ,
                0usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp8sc ) , "::" ,
                stringify ! ( re ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp8sc ) ) . im as * const _ as usize } ,
                1usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp8sc ) , "::" ,
                stringify ! ( im ) ));
}
impl Clone for Ipp8sc {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct Ipp16sc {
    pub re: Ipp16s,
    pub im: Ipp16s,
}
#[test]
fn bindgen_test_layout_Ipp16sc() {
    assert_eq!(::std::mem::size_of::<Ipp16sc>() , 4usize , concat ! (
               "Size of: " , stringify ! ( Ipp16sc ) ));
    assert_eq! (::std::mem::align_of::<Ipp16sc>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( Ipp16sc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp16sc ) ) . re as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp16sc ) , "::" ,
                stringify ! ( re ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp16sc ) ) . im as * const _ as usize }
                , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp16sc ) , "::" ,
                stringify ! ( im ) ));
}
impl Clone for Ipp16sc {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct Ipp16uc {
    pub re: Ipp16u,
    pub im: Ipp16u,
}
#[test]
fn bindgen_test_layout_Ipp16uc() {
    assert_eq!(::std::mem::size_of::<Ipp16uc>() , 4usize , concat ! (
               "Size of: " , stringify ! ( Ipp16uc ) ));
    assert_eq! (::std::mem::align_of::<Ipp16uc>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( Ipp16uc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp16uc ) ) . re as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp16uc ) , "::" ,
                stringify ! ( re ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp16uc ) ) . im as * const _ as usize }
                , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp16uc ) , "::" ,
                stringify ! ( im ) ));
}
impl Clone for Ipp16uc {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct Ipp32sc {
    pub re: Ipp32s,
    pub im: Ipp32s,
}
#[test]
fn bindgen_test_layout_Ipp32sc() {
    assert_eq!(::std::mem::size_of::<Ipp32sc>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Ipp32sc ) ));
    assert_eq! (::std::mem::align_of::<Ipp32sc>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Ipp32sc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp32sc ) ) . re as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp32sc ) , "::" ,
                stringify ! ( re ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp32sc ) ) . im as * const _ as usize }
                , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp32sc ) , "::" ,
                stringify ! ( im ) ));
}
impl Clone for Ipp32sc {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct Ipp32fc {
    pub re: Ipp32f,
    pub im: Ipp32f,
}
#[test]
fn bindgen_test_layout_Ipp32fc() {
    assert_eq!(::std::mem::size_of::<Ipp32fc>() , 8usize , concat ! (
               "Size of: " , stringify ! ( Ipp32fc ) ));
    assert_eq! (::std::mem::align_of::<Ipp32fc>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( Ipp32fc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp32fc ) ) . re as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp32fc ) , "::" ,
                stringify ! ( re ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp32fc ) ) . im as * const _ as usize }
                , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp32fc ) , "::" ,
                stringify ! ( im ) ));
}
impl Clone for Ipp32fc {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct Ipp64sc {
    pub re: Ipp64s,
    pub im: Ipp64s,
}
#[test]
fn bindgen_test_layout_Ipp64sc() {
    assert_eq!(::std::mem::size_of::<Ipp64sc>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Ipp64sc ) ));
    assert_eq! (::std::mem::align_of::<Ipp64sc>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Ipp64sc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp64sc ) ) . re as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp64sc ) , "::" ,
                stringify ! ( re ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp64sc ) ) . im as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp64sc ) , "::" ,
                stringify ! ( im ) ));
}
impl Clone for Ipp64sc {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct Ipp64fc {
    pub re: Ipp64f,
    pub im: Ipp64f,
}
#[test]
fn bindgen_test_layout_Ipp64fc() {
    assert_eq!(::std::mem::size_of::<Ipp64fc>() , 16usize , concat ! (
               "Size of: " , stringify ! ( Ipp64fc ) ));
    assert_eq! (::std::mem::align_of::<Ipp64fc>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( Ipp64fc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp64fc ) ) . re as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp64fc ) , "::" ,
                stringify ! ( re ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const Ipp64fc ) ) . im as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( Ipp64fc ) , "::" ,
                stringify ! ( im ) ));
}
impl Clone for Ipp64fc {
    fn clone(&self) -> Self { *self }
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppDataType {
    ippUndef = -1,
    ipp1u = 0,
    ipp8u = 1,
    ipp8uc = 2,
    ipp8s = 3,
    ipp8sc = 4,
    ipp16u = 5,
    ipp16uc = 6,
    ipp16s = 7,
    ipp16sc = 8,
    ipp32u = 9,
    ipp32uc = 10,
    ipp32s = 11,
    ipp32sc = 12,
    ipp32f = 13,
    ipp32fc = 14,
    ipp64u = 15,
    ipp64uc = 16,
    ipp64s = 17,
    ipp64sc = 18,
    ipp64f = 19,
    ipp64fc = 20,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppBool { ippFalse = 0, ippTrue = 1, }
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppCache {
    pub type_: ipp_ctypes::c_int,
    pub level: ipp_ctypes::c_int,
    pub size: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout_IppCache() {
    assert_eq!(::std::mem::size_of::<IppCache>() , 12usize , concat ! (
               "Size of: " , stringify ! ( IppCache ) ));
    assert_eq! (::std::mem::align_of::<IppCache>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppCache ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppCache ) ) . type_ as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppCache ) , "::" ,
                stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppCache ) ) . level as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppCache ) , "::" ,
                stringify ! ( level ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppCache ) ) . size as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppCache ) , "::" ,
                stringify ! ( size ) ));
}
impl Clone for IppCache {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]

#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppRoundMode {
    ippRndZero = 0,
    ippRndNear = 1,
    ippRndFinancial = 2,
    ippRndHintAccurate = 16,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppHintAlgorithm {
    ippAlgHintNone = 0,
    ippAlgHintFast = 1,
    ippAlgHintAccurate = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppCmpOp {
    ippCmpLess = 0,
    ippCmpLessEq = 1,
    ippCmpEq = 2,
    ippCmpGreaterEq = 3,
    ippCmpGreater = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppAlgType {
    ippAlgAuto = 0,
    ippAlgDirect = 1,
    ippAlgFFT = 2,
    ippAlgMask = 255,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppsNormOp {
    ippsNormNone = 0,
    ippsNormA = 256,
    ippsNormB = 512,
    ippsNormMask = 65280,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppNormType { ippNormInf = 1, ippNormL1 = 2, ippNormL2 = 4, }
pub const IPP_FFT_DIV_FWD_BY_N: _bindgen_ty_1 =
    _bindgen_ty_1::IPP_FFT_DIV_FWD_BY_N;
pub const IPP_FFT_DIV_INV_BY_N: _bindgen_ty_1 =
    _bindgen_ty_1::IPP_FFT_DIV_INV_BY_N;
pub const IPP_FFT_DIV_BY_SQRTN: _bindgen_ty_1 =
    _bindgen_ty_1::IPP_FFT_DIV_BY_SQRTN;
pub const IPP_FFT_NODIV_BY_ANY: _bindgen_ty_1 =
    _bindgen_ty_1::IPP_FFT_NODIV_BY_ANY;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    IPP_FFT_DIV_FWD_BY_N = 1,
    IPP_FFT_DIV_INV_BY_N = 2,
    IPP_FFT_DIV_BY_SQRTN = 4,
    IPP_FFT_NODIV_BY_ANY = 8,
}
pub const IPP_DIV_FWD_BY_N: _bindgen_ty_2 = _bindgen_ty_2::IPP_DIV_FWD_BY_N;
pub const IPP_DIV_INV_BY_N: _bindgen_ty_2 = _bindgen_ty_2::IPP_DIV_INV_BY_N;
pub const IPP_DIV_BY_SQRTN: _bindgen_ty_2 = _bindgen_ty_2::IPP_DIV_BY_SQRTN;
pub const IPP_NODIV_BY_ANY: _bindgen_ty_2 = _bindgen_ty_2::IPP_NODIV_BY_ANY;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 {
    IPP_DIV_FWD_BY_N = 1,
    IPP_DIV_INV_BY_N = 2,
    IPP_DIV_BY_SQRTN = 4,
    IPP_NODIV_BY_ANY = 8,
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppPointPolar {
    pub rho: Ipp32f,
    pub theta: Ipp32f,
}
#[test]
fn bindgen_test_layout_IppPointPolar() {
    assert_eq!(::std::mem::size_of::<IppPointPolar>() , 8usize , concat ! (
               "Size of: " , stringify ! ( IppPointPolar ) ));
    assert_eq! (::std::mem::align_of::<IppPointPolar>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppPointPolar ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppPointPolar ) ) . rho as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppPointPolar ) , "::"
                , stringify ! ( rho ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppPointPolar ) ) . theta as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppPointPolar ) , "::"
                , stringify ! ( theta ) ));
}
impl Clone for IppPointPolar {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppWinType {
    ippWinBartlett = 0,
    ippWinBlackman = 1,
    ippWinHamming = 2,
    ippWinHann = 3,
    ippWinRect = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppsIIRFilterType { ippButterworth = 0, ippChebyshev1 = 1, }
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppsZCType { ippZCR = 0, ippZCXor = 1, ippZCC = 2, }
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppsROI {
    pub left: ipp_ctypes::c_int,
    pub right: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout_IppsROI() {
    assert_eq!(::std::mem::size_of::<IppsROI>() , 8usize , concat ! (
               "Size of: " , stringify ! ( IppsROI ) ));
    assert_eq! (::std::mem::align_of::<IppsROI>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppsROI ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppsROI ) ) . left as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppsROI ) , "::" ,
                stringify ! ( left ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppsROI ) ) . right as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppsROI ) , "::" ,
                stringify ! ( right ) ));
}
impl Clone for IppsROI {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RandUniState_8u {
    _unused: [u8; 0],
}
pub type IppsRandUniState_8u = RandUniState_8u;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RandUniState_16s {
    _unused: [u8; 0],
}
pub type IppsRandUniState_16s = RandUniState_16s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RandUniState_32f {
    _unused: [u8; 0],
}
pub type IppsRandUniState_32f = RandUniState_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RandUniState_64f {
    _unused: [u8; 0],
}
pub type IppsRandUniState_64f = RandUniState_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RandGaussState_8u {
    _unused: [u8; 0],
}
pub type IppsRandGaussState_8u = RandGaussState_8u;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RandGaussState_16s {
    _unused: [u8; 0],
}
pub type IppsRandGaussState_16s = RandGaussState_16s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RandGaussState_32f {
    _unused: [u8; 0],
}
pub type IppsRandGaussState_32f = RandGaussState_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RandGaussState_64f {
    _unused: [u8; 0],
}
pub type IppsRandGaussState_64f = RandGaussState_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFTSpec_C_32fc {
    _unused: [u8; 0],
}
pub type IppsFFTSpec_C_32fc = FFTSpec_C_32fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFTSpec_C_32f {
    _unused: [u8; 0],
}
pub type IppsFFTSpec_C_32f = FFTSpec_C_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFTSpec_R_32f {
    _unused: [u8; 0],
}
pub type IppsFFTSpec_R_32f = FFTSpec_R_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFTSpec_C_64fc {
    _unused: [u8; 0],
}
pub type IppsFFTSpec_C_64fc = FFTSpec_C_64fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFTSpec_C_64f {
    _unused: [u8; 0],
}
pub type IppsFFTSpec_C_64f = FFTSpec_C_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFTSpec_R_64f {
    _unused: [u8; 0],
}
pub type IppsFFTSpec_R_64f = FFTSpec_R_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DFTSpec_C_32fc {
    _unused: [u8; 0],
}
pub type IppsDFTSpec_C_32fc = DFTSpec_C_32fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DFTSpec_C_32f {
    _unused: [u8; 0],
}
pub type IppsDFTSpec_C_32f = DFTSpec_C_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DFTSpec_R_32f {
    _unused: [u8; 0],
}
pub type IppsDFTSpec_R_32f = DFTSpec_R_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DFTSpec_C_64fc {
    _unused: [u8; 0],
}
pub type IppsDFTSpec_C_64fc = DFTSpec_C_64fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DFTSpec_C_64f {
    _unused: [u8; 0],
}
pub type IppsDFTSpec_C_64f = DFTSpec_C_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DFTSpec_R_64f {
    _unused: [u8; 0],
}
pub type IppsDFTSpec_R_64f = DFTSpec_R_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DCTFwdSpec_32f {
    _unused: [u8; 0],
}
pub type IppsDCTFwdSpec_32f = DCTFwdSpec_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DCTInvSpec_32f {
    _unused: [u8; 0],
}
pub type IppsDCTInvSpec_32f = DCTInvSpec_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DCTFwdSpec_64f {
    _unused: [u8; 0],
}
pub type IppsDCTFwdSpec_64f = DCTFwdSpec_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DCTInvSpec_64f {
    _unused: [u8; 0],
}
pub type IppsDCTInvSpec_64f = DCTInvSpec_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sWTFwdState_32f {
    _unused: [u8; 0],
}
pub type IppsWTFwdState_32f = sWTFwdState_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sWTFwdState_8u32f {
    _unused: [u8; 0],
}
pub type IppsWTFwdState_8u32f = sWTFwdState_8u32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sWTFwdState_16s32f {
    _unused: [u8; 0],
}
pub type IppsWTFwdState_16s32f = sWTFwdState_16s32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sWTFwdState_16u32f {
    _unused: [u8; 0],
}
pub type IppsWTFwdState_16u32f = sWTFwdState_16u32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sWTInvState_32f {
    _unused: [u8; 0],
}
pub type IppsWTInvState_32f = sWTInvState_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sWTInvState_32f8u {
    _unused: [u8; 0],
}
pub type IppsWTInvState_32f8u = sWTInvState_32f8u;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sWTInvState_32f16s {
    _unused: [u8; 0],
}
pub type IppsWTInvState_32f16s = sWTInvState_32f16s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sWTInvState_32f16u {
    _unused: [u8; 0],
}
pub type IppsWTInvState_32f16u = sWTInvState_32f16u;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState_32f {
    _unused: [u8; 0],
}
pub type IppsIIRState_32f = IIRState_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState_32fc {
    _unused: [u8; 0],
}
pub type IppsIIRState_32fc = IIRState_32fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState32f_16s {
    _unused: [u8; 0],
}
pub type IppsIIRState32f_16s = IIRState32f_16s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState32fc_16sc {
    _unused: [u8; 0],
}
pub type IppsIIRState32fc_16sc = IIRState32fc_16sc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState_64f {
    _unused: [u8; 0],
}
pub type IppsIIRState_64f = IIRState_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState_64fc {
    _unused: [u8; 0],
}
pub type IppsIIRState_64fc = IIRState_64fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState64f_32f {
    _unused: [u8; 0],
}
pub type IppsIIRState64f_32f = IIRState64f_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState64fc_32fc {
    _unused: [u8; 0],
}
pub type IppsIIRState64fc_32fc = IIRState64fc_32fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState64f_32s {
    _unused: [u8; 0],
}
pub type IppsIIRState64f_32s = IIRState64f_32s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState64fc_32sc {
    _unused: [u8; 0],
}
pub type IppsIIRState64fc_32sc = IIRState64fc_32sc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState64f_16s {
    _unused: [u8; 0],
}
pub type IppsIIRState64f_16s = IIRState64f_16s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRState64fc_16sc {
    _unused: [u8; 0],
}
pub type IppsIIRState64fc_16sc = IIRState64fc_16sc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FIRSpec_32f {
    _unused: [u8; 0],
}
pub type IppsFIRSpec_32f = FIRSpec_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FIRSpec_64f {
    _unused: [u8; 0],
}
pub type IppsFIRSpec_64f = FIRSpec_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FIRSpec_32fc {
    _unused: [u8; 0],
}
pub type IppsFIRSpec_32fc = FIRSpec_32fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FIRSpec_64fc {
    _unused: [u8; 0],
}
pub type IppsFIRSpec_64fc = FIRSpec_64fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FIRLMSState_32f {
    _unused: [u8; 0],
}
pub type IppsFIRLMSState_32f = FIRLMSState_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FIRLMSState32f_16s {
    _unused: [u8; 0],
}
pub type IppsFIRLMSState32f_16s = FIRLMSState32f_16s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HilbertSpec {
    _unused: [u8; 0],
}
pub type IppsHilbertSpec = HilbertSpec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FIRSparseState_32f {
    _unused: [u8; 0],
}
pub type IppsFIRSparseState_32f = FIRSparseState_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIRSparseState_32f {
    _unused: [u8; 0],
}
pub type IppsIIRSparseState_32f = IIRSparseState_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResamplingPolyphase_16s {
    _unused: [u8; 0],
}
pub type IppsResamplingPolyphase_16s = ResamplingPolyphase_16s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResamplingPolyphaseFixed_16s {
    _unused: [u8; 0],
}
pub type IppsResamplingPolyphaseFixed_16s = ResamplingPolyphaseFixed_16s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResamplingPolyphase_32f {
    _unused: [u8; 0],
}
pub type IppsResamplingPolyphase_32f = ResamplingPolyphase_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResamplingPolyphaseFixed_32f {
    _unused: [u8; 0],
}
pub type IppsResamplingPolyphaseFixed_32f = ResamplingPolyphaseFixed_32f;
pub type IppEnum = ipp_ctypes::c_int;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiNormOp {
    ippiNormNone = 0,
    ippiNorm = 256,
    ippiNormCoefficient = 512,
    ippiNormMask = 65280,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiROIShape {
    ippiROIFull = 0,
    ippiROIValid = 65536,
    ippiROISame = 131072,
    ippiROIMask = 16711680,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppChannels {
    ippC0 = 0,
    ippC1 = 1,
    ippC2 = 2,
    ippC3 = 3,
    ippC4 = 4,
    ippP2 = 5,
    ippP3 = 6,
    ippP4 = 7,
    ippAC1 = 8,
    ippAC4 = 9,
    ippA0C4 = 10,
    ippAP4 = 11,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _IppiBorderType {
    ippBorderRepl = 1,
    ippBorderWrap = 2,
    ippBorderMirror = 3,
    ippBorderMirrorR = 4,
    ippBorderDefault = 5,
    ippBorderConst = 6,
    ippBorderTransp = 7,
    ippBorderInMemTop = 16,
    ippBorderInMemBottom = 32,
    ippBorderInMemLeft = 64,
    ippBorderInMemRight = 128,
    ippBorderInMem = 240,
    ippBorderFirstStageInMem = 3840,
}
pub use self::_IppiBorderType as IppiBorderType;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiAxis {
    ippAxsHorizontal = 0,
    ippAxsVertical = 1,
    ippAxsBoth = 2,
    ippAxs45 = 3,
    ippAxs135 = 4,
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppiRect {
    pub x: ipp_ctypes::c_int,
    pub y: ipp_ctypes::c_int,
    pub width: ipp_ctypes::c_int,
    pub height: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout_IppiRect() {
    assert_eq!(::std::mem::size_of::<IppiRect>() , 16usize , concat ! (
               "Size of: " , stringify ! ( IppiRect ) ));
    assert_eq! (::std::mem::align_of::<IppiRect>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppiRect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiRect ) ) . x as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiRect ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiRect ) ) . y as * const _ as usize }
                , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiRect ) , "::" ,
                stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiRect ) ) . width as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiRect ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiRect ) ) . height as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiRect ) , "::" ,
                stringify ! ( height ) ));
}
impl Clone for IppiRect {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppiPoint {
    pub x: ipp_ctypes::c_int,
    pub y: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout_IppiPoint() {
    assert_eq!(::std::mem::size_of::<IppiPoint>() , 8usize , concat ! (
               "Size of: " , stringify ! ( IppiPoint ) ));
    assert_eq! (::std::mem::align_of::<IppiPoint>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppiPoint ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiPoint ) ) . x as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiPoint ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiPoint ) ) . y as * const _ as usize }
                , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiPoint ) , "::" ,
                stringify ! ( y ) ));
}
impl Clone for IppiPoint {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppiSize {
    pub width: ipp_ctypes::c_int,
    pub height: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout_IppiSize() {
    assert_eq!(::std::mem::size_of::<IppiSize>() , 8usize , concat ! (
               "Size of: " , stringify ! ( IppiSize ) ));
    assert_eq! (::std::mem::align_of::<IppiSize>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppiSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiSize ) ) . width as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiSize ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiSize ) ) . height as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiSize ) , "::" ,
                stringify ! ( height ) ));
}
impl Clone for IppiSize {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppiPoint_32f {
    pub x: Ipp32f,
    pub y: Ipp32f,
}
#[test]
fn bindgen_test_layout_IppiPoint_32f() {
    assert_eq!(::std::mem::size_of::<IppiPoint_32f>() , 8usize , concat ! (
               "Size of: " , stringify ! ( IppiPoint_32f ) ));
    assert_eq! (::std::mem::align_of::<IppiPoint_32f>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppiPoint_32f ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiPoint_32f ) ) . x as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiPoint_32f ) , "::"
                , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiPoint_32f ) ) . y as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiPoint_32f ) , "::"
                , stringify ! ( y ) ));
}
impl Clone for IppiPoint_32f {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _IppiMaskSize {
    ippMskSize1x3 = 13,
    ippMskSize1x5 = 15,
    ippMskSize3x1 = 31,
    ippMskSize3x3 = 33,
    ippMskSize5x1 = 51,
    ippMskSize5x5 = 55,
}
pub use self::_IppiMaskSize as IppiMaskSize;
pub const IPPI_INTER_NN: _bindgen_ty_3 = _bindgen_ty_3::IPPI_INTER_NN;
pub const IPPI_INTER_LINEAR: _bindgen_ty_3 = _bindgen_ty_3::IPPI_INTER_LINEAR;
pub const IPPI_INTER_CUBIC: _bindgen_ty_3 = _bindgen_ty_3::IPPI_INTER_CUBIC;
pub const IPPI_INTER_CUBIC2P_BSPLINE: _bindgen_ty_3 =
    _bindgen_ty_3::IPPI_INTER_CUBIC2P_BSPLINE;
pub const IPPI_INTER_CUBIC2P_CATMULLROM: _bindgen_ty_3 =
    _bindgen_ty_3::IPPI_INTER_CUBIC2P_CATMULLROM;
pub const IPPI_INTER_CUBIC2P_B05C03: _bindgen_ty_3 =
    _bindgen_ty_3::IPPI_INTER_CUBIC2P_B05C03;
pub const IPPI_INTER_SUPER: _bindgen_ty_3 = _bindgen_ty_3::IPPI_INTER_SUPER;
pub const IPPI_INTER_LANCZOS: _bindgen_ty_3 =
    _bindgen_ty_3::IPPI_INTER_LANCZOS;
pub const IPPI_ANTIALIASING: _bindgen_ty_3 = _bindgen_ty_3::IPPI_ANTIALIASING;
pub const IPPI_SUBPIXEL_EDGE: _bindgen_ty_3 =
    _bindgen_ty_3::IPPI_SUBPIXEL_EDGE;
pub const IPPI_SMOOTH_EDGE: _bindgen_ty_3 = _bindgen_ty_3::IPPI_SMOOTH_EDGE;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_3 {
    IPPI_INTER_NN = 1,
    IPPI_INTER_LINEAR = 2,
    IPPI_INTER_CUBIC = 4,
    IPPI_INTER_CUBIC2P_BSPLINE = 5,
    IPPI_INTER_CUBIC2P_CATMULLROM = 6,
    IPPI_INTER_CUBIC2P_B05C03 = 7,
    IPPI_INTER_SUPER = 8,
    IPPI_INTER_LANCZOS = 16,
    IPPI_ANTIALIASING = 536870912,
    IPPI_SUBPIXEL_EDGE = 1073741824,
    IPPI_SMOOTH_EDGE = -2147483648,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiInterpolationType {
    ippNearest = 1,
    ippLinear = 2,
    ippCubic = 6,
    ippLanczos = 16,
    ippHahn = 0,
    ippSuper = 8,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiFraction {
    ippPolyphase_1_2 = 0,
    ippPolyphase_3_5 = 1,
    ippPolyphase_2_3 = 2,
    ippPolyphase_7_10 = 3,
    ippPolyphase_3_4 = 4,
}
pub const IPP_FASTN_ORIENTATION: _bindgen_ty_4 =
    _bindgen_ty_4::IPP_FASTN_ORIENTATION;
pub const IPP_FASTN_NMS: _bindgen_ty_4 = _bindgen_ty_4::IPP_FASTN_NMS;
pub const IPP_FASTN_CIRCLE: _bindgen_ty_4 = _bindgen_ty_4::IPP_FASTN_CIRCLE;
pub const IPP_FASTN_SCORE_MODE0: _bindgen_ty_4 =
    _bindgen_ty_4::IPP_FASTN_SCORE_MODE0;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_4 {
    IPP_FASTN_ORIENTATION = 1,
    IPP_FASTN_NMS = 2,
    IPP_FASTN_CIRCLE = 4,
    IPP_FASTN_SCORE_MODE0 = 32,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiAlphaType {
    ippAlphaOver = 0,
    ippAlphaIn = 1,
    ippAlphaOut = 2,
    ippAlphaATop = 3,
    ippAlphaXor = 4,
    ippAlphaPlus = 5,
    ippAlphaOverPremul = 6,
    ippAlphaInPremul = 7,
    ippAlphaOutPremul = 8,
    ippAlphaATopPremul = 9,
    ippAlphaXorPremul = 10,
    ippAlphaPlusPremul = 11,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeconvFFTState_32f_C1R {
    _unused: [u8; 0],
}
pub type IppiDeconvFFTState_32f_C1R = DeconvFFTState_32f_C1R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeconvFFTState_32f_C3R {
    _unused: [u8; 0],
}
pub type IppiDeconvFFTState_32f_C3R = DeconvFFTState_32f_C3R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeconvLR_32f_C1R {
    _unused: [u8; 0],
}
pub type IppiDeconvLR_32f_C1R = DeconvLR_32f_C1R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeconvLR_32f_C3R {
    _unused: [u8; 0],
}
pub type IppiDeconvLR_32f_C3R = DeconvLR_32f_C3R;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiFilterBilateralType {
    ippiFilterBilateralGauss = 100,
    ippiFilterBilateralGaussFast = 101,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FilterBilateralSpec {
    _unused: [u8; 0],
}
pub type IppiFilterBilateralSpec = FilterBilateralSpec;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiDistanceMethodType { ippDistNormL1 = 2, }
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiResizeFilterType {
    ippResizeFilterHann = 0,
    ippResizeFilterLanczos = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResizeFilterState {
    _unused: [u8; 0],
}
pub type IppiResizeFilterState = ResizeFilterState;
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppiBorderSize {
    pub borderLeft: Ipp32u,
    pub borderTop: Ipp32u,
    pub borderRight: Ipp32u,
    pub borderBottom: Ipp32u,
}
#[test]
fn bindgen_test_layout_IppiBorderSize() {
    assert_eq!(::std::mem::size_of::<IppiBorderSize>() , 16usize , concat ! (
               "Size of: " , stringify ! ( IppiBorderSize ) ));
    assert_eq! (::std::mem::align_of::<IppiBorderSize>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppiBorderSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiBorderSize ) ) . borderLeft as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiBorderSize ) , "::"
                , stringify ! ( borderLeft ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiBorderSize ) ) . borderTop as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiBorderSize ) , "::"
                , stringify ! ( borderTop ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiBorderSize ) ) . borderRight as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiBorderSize ) , "::"
                , stringify ! ( borderRight ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiBorderSize ) ) . borderBottom as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiBorderSize ) , "::"
                , stringify ! ( borderBottom ) ));
}
impl Clone for IppiBorderSize {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiWarpDirection { ippWarpForward = 0, ippWarpBackward = 1, }
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiWarpTransformType {
    ippWarpAffine = 0,
    ippWarpPerspective = 1,
    ippWarpBilinear = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResizeSpec_32f {
    _unused: [u8; 0],
}
pub type IppiResizeSpec_32f = ResizeSpec_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResizeYUV422Spec {
    _unused: [u8; 0],
}
pub type IppiResizeYUV422Spec = ResizeYUV422Spec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResizeYUV420Spec {
    _unused: [u8; 0],
}
pub type IppiResizeYUV420Spec = ResizeYUV420Spec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResizeSpec_64f {
    _unused: [u8; 0],
}
pub type IppiResizeSpec_64f = ResizeSpec_64f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IppiWarpSpec {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FilterBorderSpec {
    _unused: [u8; 0],
}
pub type IppiFilterBorderSpec = FilterBorderSpec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ThresholdAdaptiveSpec {
    _unused: [u8; 0],
}
pub type IppiThresholdAdaptiveSpec = ThresholdAdaptiveSpec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HistogramSpec {
    _unused: [u8; 0],
}
pub type IppiHistogramSpec = HistogramSpec;
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppiHOGConfig {
    pub cvCompatible: ipp_ctypes::c_int,
    pub cellSize: ipp_ctypes::c_int,
    pub blockSize: ipp_ctypes::c_int,
    pub blockStride: ipp_ctypes::c_int,
    pub nbins: ipp_ctypes::c_int,
    pub sigma: Ipp32f,
    pub l2thresh: Ipp32f,
    pub winSize: IppiSize,
}
#[test]
fn bindgen_test_layout_IppiHOGConfig() {
    assert_eq!(::std::mem::size_of::<IppiHOGConfig>() , 36usize , concat ! (
               "Size of: " , stringify ! ( IppiHOGConfig ) ));
    assert_eq! (::std::mem::align_of::<IppiHOGConfig>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppiHOGConfig ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiHOGConfig ) ) . cvCompatible as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiHOGConfig ) , "::"
                , stringify ! ( cvCompatible ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiHOGConfig ) ) . cellSize as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiHOGConfig ) , "::"
                , stringify ! ( cellSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiHOGConfig ) ) . blockSize as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiHOGConfig ) , "::"
                , stringify ! ( blockSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiHOGConfig ) ) . blockStride as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiHOGConfig ) , "::"
                , stringify ! ( blockStride ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiHOGConfig ) ) . nbins as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiHOGConfig ) , "::"
                , stringify ! ( nbins ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiHOGConfig ) ) . sigma as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiHOGConfig ) , "::"
                , stringify ! ( sigma ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiHOGConfig ) ) . l2thresh as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiHOGConfig ) , "::"
                , stringify ! ( l2thresh ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiHOGConfig ) ) . winSize as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiHOGConfig ) , "::"
                , stringify ! ( winSize ) ));
}
impl Clone for IppiHOGConfig {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFT2DSpec_C_32fc {
    _unused: [u8; 0],
}
pub type IppiFFTSpec_C_32fc = FFT2DSpec_C_32fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFT2DSpec_R_32f {
    _unused: [u8; 0],
}
pub type IppiFFTSpec_R_32f = FFT2DSpec_R_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DFT2DSpec_C_32fc {
    _unused: [u8; 0],
}
pub type IppiDFTSpec_C_32fc = DFT2DSpec_C_32fc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DFT2DSpec_R_32f {
    _unused: [u8; 0],
}
pub type IppiDFTSpec_R_32f = DFT2DSpec_R_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DCT2DFwdSpec_32f {
    _unused: [u8; 0],
}
pub type IppiDCTFwdSpec_32f = DCT2DFwdSpec_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DCT2DInvSpec_32f {
    _unused: [u8; 0],
}
pub type IppiDCTInvSpec_32f = DCT2DInvSpec_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iWTFwdSpec_32f_C1R {
    _unused: [u8; 0],
}
pub type IppiWTFwdSpec_32f_C1R = iWTFwdSpec_32f_C1R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iWTInvSpec_32f_C1R {
    _unused: [u8; 0],
}
pub type IppiWTInvSpec_32f_C1R = iWTInvSpec_32f_C1R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iWTFwdSpec_32f_C3R {
    _unused: [u8; 0],
}
pub type IppiWTFwdSpec_32f_C3R = iWTFwdSpec_32f_C3R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iWTInvSpec_32f_C3R {
    _unused: [u8; 0],
}
pub type IppiWTInvSpec_32f_C3R = iWTInvSpec_32f_C3R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MomentState64f {
    _unused: [u8; 0],
}
pub type IppiMomentState_64f = MomentState64f;
pub type IppiHuMoment_64f = [Ipp64f; 7usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LUT_Spec {
    _unused: [u8; 0],
}
pub type IppiLUT_Spec = LUT_Spec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ipHOG {
    _unused: [u8; 0],
}
pub type IppiHOGSpec = _ipHOG;
/// Below are 3D Image (Volume) Processing specific definitions
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IpprVolume {
    pub width: ipp_ctypes::c_int,
    pub height: ipp_ctypes::c_int,
    pub depth: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout_IpprVolume() {
    assert_eq!(::std::mem::size_of::<IpprVolume>() , 12usize , concat ! (
               "Size of: " , stringify ! ( IpprVolume ) ));
    assert_eq! (::std::mem::align_of::<IpprVolume>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IpprVolume ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprVolume ) ) . width as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprVolume ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprVolume ) ) . height as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprVolume ) , "::" ,
                stringify ! ( height ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprVolume ) ) . depth as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprVolume ) , "::" ,
                stringify ! ( depth ) ));
}
impl Clone for IpprVolume {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IpprCuboid {
    pub x: ipp_ctypes::c_int,
    pub y: ipp_ctypes::c_int,
    pub z: ipp_ctypes::c_int,
    pub width: ipp_ctypes::c_int,
    pub height: ipp_ctypes::c_int,
    pub depth: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout_IpprCuboid() {
    assert_eq!(::std::mem::size_of::<IpprCuboid>() , 24usize , concat ! (
               "Size of: " , stringify ! ( IpprCuboid ) ));
    assert_eq! (::std::mem::align_of::<IpprCuboid>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IpprCuboid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprCuboid ) ) . x as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprCuboid ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprCuboid ) ) . y as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprCuboid ) , "::" ,
                stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprCuboid ) ) . z as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprCuboid ) , "::" ,
                stringify ! ( z ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprCuboid ) ) . width as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprCuboid ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprCuboid ) ) . height as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprCuboid ) , "::" ,
                stringify ! ( height ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprCuboid ) ) . depth as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprCuboid ) , "::" ,
                stringify ! ( depth ) ));
}
impl Clone for IpprCuboid {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IpprPoint {
    pub x: ipp_ctypes::c_int,
    pub y: ipp_ctypes::c_int,
    pub z: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout_IpprPoint() {
    assert_eq!(::std::mem::size_of::<IpprPoint>() , 12usize , concat ! (
               "Size of: " , stringify ! ( IpprPoint ) ));
    assert_eq! (::std::mem::align_of::<IpprPoint>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IpprPoint ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprPoint ) ) . x as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprPoint ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprPoint ) ) . y as * const _ as usize }
                , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprPoint ) , "::" ,
                stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IpprPoint ) ) . z as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IpprPoint ) , "::" ,
                stringify ! ( z ) ));
}
impl Clone for IpprPoint {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]

#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _IppiDifferentialKernel {
    ippFilterSobelVert = 0,
    ippFilterSobelHoriz = 1,
    ippFilterSobel = 2,
    ippFilterScharrVert = 3,
    ippFilterScharrHoriz = 4,
    ippFilterScharr = 5,
    ippFilterCentralDiffVert = 6,
    ippFilterCentralDiffHoriz = 7,
    ippFilterCentralDiff = 8,
}
pub use self::_IppiDifferentialKernel as IppiDifferentialKernel;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _IppiKernelType {
    ippKernelSobel = 0,
    ippKernelScharr = 1,
    ippKernelSobelNeg = 2,
}
pub use self::_IppiKernelType as IppiKernelType;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _IppiNorm {
    ippiNormInf = 0,
    ippiNormL1 = 1,
    ippiNormL2 = 2,
    ippiNormFM = 3,
}
pub use self::_IppiNorm as IppiNorm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvMorphState {
    _unused: [u8; 0],
}
pub type IppiMorphState = ipcvMorphState;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvMorphStateL {
    _unused: [u8; 0],
}
pub type IppiMorphStateL = ipcvMorphStateL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvMorphAdvState {
    _unused: [u8; 0],
}
pub type IppiMorphAdvState = ipcvMorphAdvState;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvMorphAdvStateL {
    _unused: [u8; 0],
}
pub type IppiMorphAdvStateL = ipcvMorphAdvStateL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvMorphGrayState_8u {
    _unused: [u8; 0],
}
pub type IppiMorphGrayState_8u = ipcvMorphGrayState_8u;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvMorphGrayState_8uL {
    _unused: [u8; 0],
}
pub type IppiMorphGrayState_8uL = ipcvMorphGrayState_8uL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvMorphGrayState_32f {
    _unused: [u8; 0],
}
pub type IppiMorphGrayState_32f = ipcvMorphGrayState_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvMorphGrayState_32fL {
    _unused: [u8; 0],
}
pub type IppiMorphGrayState_32fL = ipcvMorphGrayState_32fL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvConvState {
    _unused: [u8; 0],
}
pub type IppiConvState = ipcvConvState;
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct _IppiConnectedComp {
    pub area: Ipp64f,
    pub value: [Ipp64f; 3usize],
    pub rect: IppiRect,
}
#[test]
fn bindgen_test_layout__IppiConnectedComp() {
    assert_eq!(::std::mem::size_of::<_IppiConnectedComp>() , 48usize , concat
               ! ( "Size of: " , stringify ! ( _IppiConnectedComp ) ));
    assert_eq! (::std::mem::align_of::<_IppiConnectedComp>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( _IppiConnectedComp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiConnectedComp ) ) . area as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiConnectedComp ) ,
                "::" , stringify ! ( area ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiConnectedComp ) ) . value as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiConnectedComp ) ,
                "::" , stringify ! ( value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiConnectedComp ) ) . rect as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiConnectedComp ) ,
                "::" , stringify ! ( rect ) ));
}
impl Clone for _IppiConnectedComp {
    fn clone(&self) -> Self { *self }
}
pub type IppiConnectedComp = _IppiConnectedComp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyramidState {
    _unused: [u8; 0],
}
pub type IppiPyramidState = PyramidState;
pub type IppiPyramidDownState_8u_C1R = IppiPyramidState;
pub type IppiPyramidDownState_16u_C1R = IppiPyramidState;
pub type IppiPyramidDownState_32f_C1R = IppiPyramidState;
pub type IppiPyramidDownState_8u_C3R = IppiPyramidState;
pub type IppiPyramidDownState_16u_C3R = IppiPyramidState;
pub type IppiPyramidDownState_32f_C3R = IppiPyramidState;
pub type IppiPyramidUpState_8u_C1R = IppiPyramidState;
pub type IppiPyramidUpState_16u_C1R = IppiPyramidState;
pub type IppiPyramidUpState_32f_C1R = IppiPyramidState;
pub type IppiPyramidUpState_8u_C3R = IppiPyramidState;
pub type IppiPyramidUpState_16u_C3R = IppiPyramidState;
pub type IppiPyramidUpState_32f_C3R = IppiPyramidState;
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct _IppiPyramid {
    pub pImage: *mut *mut Ipp8u,
    pub pRoi: *mut IppiSize,
    pub pRate: *mut Ipp64f,
    pub pStep: *mut ipp_ctypes::c_int,
    pub pState: *mut Ipp8u,
    pub level: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout__IppiPyramid() {
    assert_eq!(::std::mem::size_of::<_IppiPyramid>() , 48usize , concat ! (
               "Size of: " , stringify ! ( _IppiPyramid ) ));
    assert_eq! (::std::mem::align_of::<_IppiPyramid>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IppiPyramid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiPyramid ) ) . pImage as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiPyramid ) , "::" ,
                stringify ! ( pImage ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiPyramid ) ) . pRoi as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiPyramid ) , "::" ,
                stringify ! ( pRoi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiPyramid ) ) . pRate as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiPyramid ) , "::" ,
                stringify ! ( pRate ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiPyramid ) ) . pStep as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiPyramid ) , "::" ,
                stringify ! ( pStep ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiPyramid ) ) . pState as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiPyramid ) , "::" ,
                stringify ! ( pState ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiPyramid ) ) . level as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiPyramid ) , "::" ,
                stringify ! ( level ) ));
}
impl Clone for _IppiPyramid {
    fn clone(&self) -> Self { *self }
}
pub type IppiPyramid = _IppiPyramid;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OptFlowPyrLK {
    _unused: [u8; 0],
}
pub type IppiOptFlowPyrLK = OptFlowPyrLK;
pub type IppiOptFlowPyrLK_8u_C1R = IppiOptFlowPyrLK;
pub type IppiOptFlowPyrLK_16u_C1R = IppiOptFlowPyrLK;
pub type IppiOptFlowPyrLK_32f_C1R = IppiOptFlowPyrLK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvHaarClassifier_32f {
    _unused: [u8; 0],
}
pub type IppiHaarClassifier_32f = ipcvHaarClassifier_32f;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvHaarClassifier_32s {
    _unused: [u8; 0],
}
pub type IppiHaarClassifier_32s = ipcvHaarClassifier_32s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvFGHistogramState_8u_C1R {
    _unused: [u8; 0],
}
pub type IppFGHistogramState_8u_C1R = ipcvFGHistogramState_8u_C1R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvFGHistogramState_8u_C3R {
    _unused: [u8; 0],
}
pub type IppFGHistogramState_8u_C3R = ipcvFGHistogramState_8u_C3R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvFGGaussianState_8u_C1R {
    _unused: [u8; 0],
}
pub type IppFGGaussianState_8u_C1R = ipcvFGGaussianState_8u_C1R;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvFGGaussianState_8u_C3R {
    _unused: [u8; 0],
}
pub type IppFGGaussianState_8u_C3R = ipcvFGGaussianState_8u_C3R;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _IppiInpaintFlag { IPP_INPAINT_TELEA = 0, IPP_INPAINT_NS = 1, }
pub use self::_IppiInpaintFlag as IppiInpaintFlag;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ippcvFilterGaussianSpec {
    _unused: [u8; 0],
}
pub type IppFilterGaussianSpec = ippcvFilterGaussianSpec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipcvInpaintState_8u {
    _unused: [u8; 0],
}
pub type IppiInpaintState_8u_C1R = ipcvInpaintState_8u;
pub type IppiInpaintState_8u_C3R = ipcvInpaintState_8u;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HoughProbSpec {
    _unused: [u8; 0],
}
pub type IppiHoughProbSpec = HoughProbSpec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FastNSpec {
    _unused: [u8; 0],
}
pub type IppiFastNSpec = FastNSpec;
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct _IppiCornerFastN {
    pub x: ipp_ctypes::c_int,
    pub y: ipp_ctypes::c_int,
    pub cornerType: ipp_ctypes::c_int,
    pub orientation: ipp_ctypes::c_int,
    pub angle: f32,
    pub score: f32,
}
#[test]
fn bindgen_test_layout__IppiCornerFastN() {
    assert_eq!(::std::mem::size_of::<_IppiCornerFastN>() , 24usize , concat !
               ( "Size of: " , stringify ! ( _IppiCornerFastN ) ));
    assert_eq! (::std::mem::align_of::<_IppiCornerFastN>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( _IppiCornerFastN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiCornerFastN ) ) . x as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiCornerFastN ) ,
                "::" , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiCornerFastN ) ) . y as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiCornerFastN ) ,
                "::" , stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiCornerFastN ) ) . cornerType as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiCornerFastN ) ,
                "::" , stringify ! ( cornerType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiCornerFastN ) ) . orientation as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiCornerFastN ) ,
                "::" , stringify ! ( orientation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiCornerFastN ) ) . angle as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiCornerFastN ) ,
                "::" , stringify ! ( angle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IppiCornerFastN ) ) . score as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( _IppiCornerFastN ) ,
                "::" , stringify ! ( score ) ));
}
impl Clone for _IppiCornerFastN {
    fn clone(&self) -> Self { *self }
}
pub type IppiCornerFastN = _IppiCornerFastN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FGMMState_8u_C3R {
    _unused: [u8; 0],
}
pub type IppFGMMState_8u_C3R = FGMMState_8u_C3R;
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppFGMModel {
    pub numFrames: ipp_ctypes::c_uint,
    pub maxNGauss: ipp_ctypes::c_uint,
    pub varInit: Ipp32f,
    pub varMin: Ipp32f,
    pub varMax: Ipp32f,
    pub varWBRatio: Ipp32f,
    pub bckgThr: Ipp32f,
    pub varNGRatio: Ipp32f,
    pub reduction: Ipp32f,
    pub shadowValue: Ipp8u,
    pub shadowFlag: ipp_ctypes::c_char,
    pub shadowRatio: Ipp32f,
}
#[test]
fn bindgen_test_layout_IppFGMModel() {
    assert_eq!(::std::mem::size_of::<IppFGMModel>() , 44usize , concat ! (
               "Size of: " , stringify ! ( IppFGMModel ) ));
    assert_eq! (::std::mem::align_of::<IppFGMModel>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IppFGMModel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . numFrames as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( numFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . maxNGauss as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( maxNGauss ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . varInit as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( varInit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . varMin as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( varMin ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . varMax as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( varMax ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . varWBRatio as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( varWBRatio ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . bckgThr as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( bckgThr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . varNGRatio as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( varNGRatio ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . reduction as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( reduction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . shadowValue as * const
                _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( shadowValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . shadowFlag as * const _
                as usize } , 37usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( shadowFlag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppFGMModel ) ) . shadowRatio as * const
                _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( IppFGMModel ) , "::" ,
                stringify ! ( shadowRatio ) ));
}
impl Clone for IppFGMModel {
    fn clone(&self) -> Self { *self }
}
pub const IPP_UPPER: _bindgen_ty_5 = _bindgen_ty_5::IPP_UPPER;
pub const IPP_LEFT: _bindgen_ty_5 = _bindgen_ty_5::IPP_LEFT;
pub const IPP_CENTER: _bindgen_ty_5 = _bindgen_ty_5::IPP_CENTER;
pub const IPP_RIGHT: _bindgen_ty_5 = _bindgen_ty_5::IPP_RIGHT;
pub const IPP_LOWER: _bindgen_ty_5 = _bindgen_ty_5::IPP_LOWER;
pub const IPP_UPPER_LEFT: _bindgen_ty_5 = _bindgen_ty_5::IPP_UPPER_LEFT;
pub const IPP_UPPER_RIGHT: _bindgen_ty_5 = _bindgen_ty_5::IPP_UPPER_RIGHT;
pub const IPP_LOWER_LEFT: _bindgen_ty_5 = _bindgen_ty_5::IPP_LOWER_LEFT;
pub const IPP_LOWER_RIGHT: _bindgen_ty_5 = _bindgen_ty_5::IPP_LOWER_RIGHT;
#[repr(u32)]

#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_5 {
    IPP_UPPER = 1,
    IPP_LEFT = 2,
    IPP_CENTER = 4,
    IPP_RIGHT = 8,
    IPP_LOWER = 16,
    IPP_UPPER_LEFT = 32,
    IPP_UPPER_RIGHT = 64,
    IPP_LOWER_LEFT = 128,
    IPP_LOWER_RIGHT = 256,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiDitherType {
    ippDitherNone = 0,
    ippDitherFS = 1,
    ippDitherJJN = 2,
    ippDitherStucki = 3,
    ippDitherBayer = 4,
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppRegExpFind {
    pub pFind: *mut ipp_ctypes::c_void,
    pub lenFind: ipp_ctypes::c_int,
}
#[test]
fn bindgen_test_layout_IppRegExpFind() {
    assert_eq!(::std::mem::size_of::<IppRegExpFind>() , 16usize , concat ! (
               "Size of: " , stringify ! ( IppRegExpFind ) ));
    assert_eq! (::std::mem::align_of::<IppRegExpFind>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( IppRegExpFind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppRegExpFind ) ) . pFind as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppRegExpFind ) , "::"
                , stringify ! ( pFind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppRegExpFind ) ) . lenFind as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppRegExpFind ) , "::"
                , stringify ! ( lenFind ) ));
}
impl Clone for IppRegExpFind {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RegExpState {
    _unused: [u8; 0],
}
pub type IppRegExpState = RegExpState;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppRegExpFormat { ippFmtASCII = 0, ippFmtUTF8 = 1, }
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RegExpReplaceState {
    _unused: [u8; 0],
}
pub type IppRegExpReplaceState = RegExpReplaceState;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MTFState_8u {
    _unused: [u8; 0],
}
pub type IppMTFState_8u = MTFState_8u;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppBWTSortAlgorithmHint {
    ippBWTItohTanakaLimSort = 0,
    ippBWTItohTanakaUnlimSort = 1,
    ippBWTSuffixSort = 2,
    ippBWTAutoSort = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LZSSState_8u {
    _unused: [u8; 0],
}
pub type IppLZSSState_8u = LZSSState_8u;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LZ77State_8u {
    _unused: [u8; 0],
}
pub type IppLZ77State_8u = LZ77State_8u;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppLZ77ComprLevel {
    IppLZ77FastCompr = 0,
    IppLZ77AverageCompr = 1,
    IppLZ77BestCompr = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppLZ77Chcksm {
    IppLZ77NoChcksm = 0,
    IppLZ77Adler32 = 1,
    IppLZ77CRC32 = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppLZ77Flush {
    IppLZ77NoFlush = 0,
    IppLZ77SyncFlush = 1,
    IppLZ77FullFlush = 2,
    IppLZ77FinishFlush = 3,
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppLZ77Pairs_16u {
    pub length: Ipp16u,
    pub offset: Ipp16u,
}
#[test]
fn bindgen_test_layout_IppLZ77Pairs_16u() {
    assert_eq!(::std::mem::size_of::<IppLZ77Pairs_16u>() , 4usize , concat ! (
               "Size of: " , stringify ! ( IppLZ77Pairs_16u ) ));
    assert_eq! (::std::mem::align_of::<IppLZ77Pairs_16u>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( IppLZ77Pairs_16u ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLZ77Pairs_16u ) ) . length as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLZ77Pairs_16u ) ,
                "::" , stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppLZ77Pairs_16u ) ) . offset as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( IppLZ77Pairs_16u ) ,
                "::" , stringify ! ( offset ) ));
}
impl Clone for IppLZ77Pairs_16u {
    fn clone(&self) -> Self { *self }
}
pub type IppLZ77Pair = IppLZ77Pairs_16u;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppLZ77DeflateStatus {
    IppLZ77StatusInit = 0,
    IppLZ77StatusLZ77Process = 1,
    IppLZ77StatusHuffProcess = 2,
    IppLZ77StatusFinal = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppLZ77HuffMode {
    IppLZ77UseFixed = 0,
    IppLZ77UseDynamic = 1,
    IppLZ77UseStored = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppLZ77InflateStatus {
    IppLZ77InflateStatusInit = 0,
    IppLZ77InflateStatusHuffProcess = 1,
    IppLZ77InflateStatusLZ77Process = 2,
    IppLZ77InflateStatusFinal = 3,
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppInflateState {
    pub pWindow: *const Ipp8u,
    pub winSize: ipp_ctypes::c_uint,
    pub tableType: ipp_ctypes::c_uint,
    pub tableBufferSize: ipp_ctypes::c_uint,
}
#[test]
fn bindgen_test_layout_IppInflateState() {
    assert_eq!(::std::mem::size_of::<IppInflateState>() , 24usize , concat ! (
               "Size of: " , stringify ! ( IppInflateState ) ));
    assert_eq! (::std::mem::align_of::<IppInflateState>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( IppInflateState ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppInflateState ) ) . pWindow as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppInflateState ) ,
                "::" , stringify ! ( pWindow ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppInflateState ) ) . winSize as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppInflateState ) ,
                "::" , stringify ! ( winSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppInflateState ) ) . tableType as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( IppInflateState ) ,
                "::" , stringify ! ( tableType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppInflateState ) ) . tableBufferSize as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( IppInflateState ) ,
                "::" , stringify ! ( tableBufferSize ) ));
}
impl Clone for IppInflateState {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppInflateMode { ippTYPE = 0, ippLEN = 1, ippLENEXT = 2, }
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppDeflateFreqTable {
    pub freq: Ipp16u,
    pub code: Ipp16u,
}
#[test]
fn bindgen_test_layout_IppDeflateFreqTable() {
    assert_eq!(::std::mem::size_of::<IppDeflateFreqTable>() , 4usize , concat
               ! ( "Size of: " , stringify ! ( IppDeflateFreqTable ) ));
    assert_eq! (::std::mem::align_of::<IppDeflateFreqTable>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( IppDeflateFreqTable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppDeflateFreqTable ) ) . freq as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppDeflateFreqTable ) ,
                "::" , stringify ! ( freq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppDeflateFreqTable ) ) . code as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( IppDeflateFreqTable ) ,
                "::" , stringify ! ( code ) ));
}
impl Clone for IppDeflateFreqTable {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppDeflateHuffCode {
    pub code: Ipp16u,
    pub len: Ipp16u,
}
#[test]
fn bindgen_test_layout_IppDeflateHuffCode() {
    assert_eq!(::std::mem::size_of::<IppDeflateHuffCode>() , 4usize , concat !
               ( "Size of: " , stringify ! ( IppDeflateHuffCode ) ));
    assert_eq! (::std::mem::align_of::<IppDeflateHuffCode>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( IppDeflateHuffCode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppDeflateHuffCode ) ) . code as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppDeflateHuffCode ) ,
                "::" , stringify ! ( code ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppDeflateHuffCode ) ) . len as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( IppDeflateHuffCode ) ,
                "::" , stringify ! ( len ) ));
}
impl Clone for IppDeflateHuffCode {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RLEState_BZ2 {
    _unused: [u8; 0],
}
pub type IppRLEState_BZ2 = RLEState_BZ2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EncodeHuffState_BZ2 {
    _unused: [u8; 0],
}
pub type IppEncodeHuffState_BZ2 = EncodeHuffState_BZ2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DecodeHuffState_BZ2 {
    _unused: [u8; 0],
}
pub type IppDecodeHuffState_BZ2 = DecodeHuffState_BZ2;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppLZOMethod { IppLZO1XST = 0, IppLZO1XMT = 1, }
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LZOState_8u {
    _unused: [u8; 0],
}
pub type IppLZOState_8u = LZOState_8u;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppStatus {
    ippStsNotSupportedModeErr = -9999,
    ippStsCpuNotSupportedErr = -9998,
    ippStsInplaceModeNotSupportedErr = -9997,
    ippStsIIRIIRLengthErr = -234,
    ippStsWarpTransformTypeErr = -233,
    ippStsExceededSizeErr = -232,
    ippStsWarpDirectionErr = -231,
    ippStsFilterTypeErr = -230,
    ippStsNormErr = -229,
    ippStsAlgTypeErr = -228,
    ippStsMisalignedOffsetErr = -227,
    ippStsQuadraticNonResidueErr = -226,
    ippStsBorderErr = -225,
    ippStsDitherTypeErr = -224,
    ippStsH264BufferFullErr = -223,
    ippStsWrongAffinitySettingErr = -222,
    ippStsLoadDynErr = -221,
    ippStsPointAtInfinity = -220,
    ippStsUnknownStatusCodeErr = -216,
    ippStsOFBSizeErr = -215,
    ippStsLzoBrokenStreamErr = -214,
    ippStsRoundModeNotSupportedErr = -213,
    ippStsDecimateFractionErr = -212,
    ippStsWeightErr = -211,
    ippStsQualityIndexErr = -210,
    ippStsIIRPassbandRippleErr = -209,
    ippStsFilterFrequencyErr = -208,
    ippStsFIRGenOrderErr = -207,
    ippStsIIRGenOrderErr = -206,
    ippStsConvergeErr = -205,
    ippStsSizeMatchMatrixErr = -204,
    ippStsCountMatrixErr = -203,
    ippStsRoiShiftMatrixErr = -202,
    ippStsResizeNoOperationErr = -201,
    ippStsSrcDataErr = -200,
    ippStsMaxLenHuffCodeErr = -199,
    ippStsCodeLenTableErr = -198,
    ippStsFreqTableErr = -197,
    ippStsIncompleteContextErr = -196,
    ippStsSingularErr = -195,
    ippStsSparseErr = -194,
    ippStsBitOffsetErr = -193,
    ippStsQPErr = -192,
    ippStsVLCErr = -191,
    ippStsRegExpOptionsErr = -190,
    ippStsRegExpErr = -189,
    ippStsRegExpMatchLimitErr = -188,
    ippStsRegExpQuantifierErr = -187,
    ippStsRegExpGroupingErr = -186,
    ippStsRegExpBackRefErr = -185,
    ippStsRegExpChClassErr = -184,
    ippStsRegExpMetaChErr = -183,
    ippStsStrideMatrixErr = -182,
    ippStsCTRSizeErr = -181,
    ippStsJPEG2KCodeBlockIsNotAttached = -180,
    ippStsNotPosDefErr = -179,
    ippStsEphemeralKeyErr = -178,
    ippStsMessageErr = -177,
    ippStsShareKeyErr = -176,
    ippStsIvalidPublicKey = -175,
    ippStsIvalidPrivateKey = -174,
    ippStsOutOfECErr = -173,
    ippStsECCInvalidFlagErr = -172,
    ippStsMP3FrameHeaderErr = -171,
    ippStsMP3SideInfoErr = -170,
    ippStsBlockStepErr = -169,
    ippStsMBStepErr = -168,
    ippStsAacPrgNumErr = -167,
    ippStsAacSectCbErr = -166,
    ippStsAacSfValErr = -164,
    ippStsAacCoefValErr = -163,
    ippStsAacMaxSfbErr = -162,
    ippStsAacPredSfbErr = -161,
    ippStsAacPlsDataErr = -160,
    ippStsAacGainCtrErr = -159,
    ippStsAacSectErr = -158,
    ippStsAacTnsNumFiltErr = -157,
    ippStsAacTnsLenErr = -156,
    ippStsAacTnsOrderErr = -155,
    ippStsAacTnsCoefResErr = -154,
    ippStsAacTnsCoefErr = -153,
    ippStsAacTnsDirectErr = -152,
    ippStsAacTnsProfileErr = -151,
    ippStsAacErr = -150,
    ippStsAacBitOffsetErr = -149,
    ippStsAacAdtsSyncWordErr = -148,
    ippStsAacSmplRateIdxErr = -147,
    ippStsAacWinLenErr = -146,
    ippStsAacWinGrpErr = -145,
    ippStsAacWinSeqErr = -144,
    ippStsAacComWinErr = -143,
    ippStsAacStereoMaskErr = -142,
    ippStsAacChanErr = -141,
    ippStsAacMonoStereoErr = -140,
    ippStsAacStereoLayerErr = -139,
    ippStsAacMonoLayerErr = -138,
    ippStsAacScalableErr = -137,
    ippStsAacObjTypeErr = -136,
    ippStsAacWinShapeErr = -135,
    ippStsAacPcmModeErr = -134,
    ippStsVLCUsrTblHeaderErr = -133,
    ippStsVLCUsrTblUnsupportedFmtErr = -132,
    ippStsVLCUsrTblEscAlgTypeErr = -131,
    ippStsVLCUsrTblEscCodeLengthErr = -130,
    ippStsVLCUsrTblCodeLengthErr = -129,
    ippStsVLCInternalTblErr = -128,
    ippStsVLCInputDataErr = -127,
    ippStsVLCAACEscCodeLengthErr = -126,
    ippStsNoiseRangeErr = -125,
    ippStsUnderRunErr = -124,
    ippStsPaddingErr = -123,
    ippStsCFBSizeErr = -122,
    ippStsPaddingSchemeErr = -121,
    ippStsInvalidCryptoKeyErr = -120,
    ippStsLengthErr = -119,
    ippStsBadModulusErr = -118,
    ippStsLPCCalcErr = -117,
    ippStsRCCalcErr = -116,
    ippStsIncorrectLSPErr = -115,
    ippStsNoRootFoundErr = -114,
    ippStsJPEG2KBadPassNumber = -113,
    ippStsJPEG2KDamagedCodeBlock = -112,
    ippStsH263CBPYCodeErr = -111,
    ippStsH263MCBPCInterCodeErr = -110,
    ippStsH263MCBPCIntraCodeErr = -109,
    ippStsNotEvenStepErr = -108,
    ippStsHistoNofLevelsErr = -107,
    ippStsLUTNofLevelsErr = -106,
    ippStsMP4BitOffsetErr = -105,
    ippStsMP4QPErr = -104,
    ippStsMP4BlockIdxErr = -103,
    ippStsMP4BlockTypeErr = -102,
    ippStsMP4MVCodeErr = -101,
    ippStsMP4VLCCodeErr = -100,
    ippStsMP4DCCodeErr = -99,
    ippStsMP4FcodeErr = -98,
    ippStsMP4AlignErr = -97,
    ippStsMP4TempDiffErr = -96,
    ippStsMP4BlockSizeErr = -95,
    ippStsMP4ZeroBABErr = -94,
    ippStsMP4PredDirErr = -93,
    ippStsMP4BitsPerPixelErr = -92,
    ippStsMP4VideoCompModeErr = -91,
    ippStsMP4LinearModeErr = -90,
    ippStsH263PredModeErr = -83,
    ippStsH263BlockStepErr = -82,
    ippStsH263MBStepErr = -81,
    ippStsH263FrameWidthErr = -80,
    ippStsH263FrameHeightErr = -79,
    ippStsH263ExpandPelsErr = -78,
    ippStsH263PlaneStepErr = -77,
    ippStsH263QuantErr = -76,
    ippStsH263MVCodeErr = -75,
    ippStsH263VLCCodeErr = -74,
    ippStsH263DCCodeErr = -73,
    ippStsH263ZigzagLenErr = -72,
    ippStsFBankFreqErr = -71,
    ippStsFBankFlagErr = -70,
    ippStsFBankErr = -69,
    ippStsNegOccErr = -67,
    ippStsCdbkFlagErr = -66,
    ippStsSVDCnvgErr = -65,
    ippStsJPEGHuffTableErr = -64,
    ippStsJPEGDCTRangeErr = -63,
    ippStsJPEGOutOfBufErr = -62,
    ippStsDrawTextErr = -61,
    ippStsChannelOrderErr = -60,
    ippStsZeroMaskValuesErr = -59,
    ippStsQuadErr = -58,
    ippStsRectErr = -57,
    ippStsCoeffErr = -56,
    ippStsNoiseValErr = -55,
    ippStsDitherLevelsErr = -54,
    ippStsNumChannelsErr = -53,
    ippStsCOIErr = -52,
    ippStsDivisorErr = -51,
    ippStsAlphaTypeErr = -50,
    ippStsGammaRangeErr = -49,
    ippStsGrayCoefSumErr = -48,
    ippStsChannelErr = -47,
    ippStsToneMagnErr = -46,
    ippStsToneFreqErr = -45,
    ippStsTonePhaseErr = -44,
    ippStsTrnglMagnErr = -43,
    ippStsTrnglFreqErr = -42,
    ippStsTrnglPhaseErr = -41,
    ippStsTrnglAsymErr = -40,
    ippStsHugeWinErr = -39,
    ippStsJaehneErr = -38,
    ippStsStrideErr = -37,
    ippStsEpsValErr = -36,
    ippStsWtOffsetErr = -35,
    ippStsAnchorErr = -34,
    ippStsMaskSizeErr = -33,
    ippStsShiftErr = -32,
    ippStsSampleFactorErr = -31,
    ippStsSamplePhaseErr = -30,
    ippStsFIRMRFactorErr = -29,
    ippStsFIRMRPhaseErr = -28,
    ippStsRelFreqErr = -27,
    ippStsFIRLenErr = -26,
    ippStsIIROrderErr = -25,
    ippStsDlyLineIndexErr = -24,
    ippStsResizeFactorErr = -23,
    ippStsInterpolationErr = -22,
    ippStsMirrorFlipErr = -21,
    ippStsMoment00ZeroErr = -20,
    ippStsThreshNegLevelErr = -19,
    ippStsThresholdErr = -18,
    ippStsContextMatchErr = -17,
    ippStsFftFlagErr = -16,
    ippStsFftOrderErr = -15,
    ippStsStepErr = -14,
    ippStsScaleRangeErr = -13,
    ippStsDataTypeErr = -12,
    ippStsOutOfRangeErr = -11,
    ippStsDivByZeroErr = -10,
    ippStsMemAllocErr = -9,
    ippStsNullPtrErr = -8,
    ippStsRangeErr = -7,
    ippStsSizeErr = -6,
    ippStsBadArgErr = -5,
    ippStsNoMemErr = -4,
    ippStsSAReservedErr3 = -3,
    ippStsErr = -2,
    ippStsSAReservedErr1 = -1,
    ippStsNoErr = 0,
    ippStsNoOperation = 1,
    ippStsMisalignedBuf = 2,
    ippStsSqrtNegArg = 3,
    ippStsInvZero = 4,
    ippStsEvenMedianMaskSize = 5,
    ippStsDivByZero = 6,
    ippStsLnZeroArg = 7,
    ippStsLnNegArg = 8,
    ippStsNanArg = 9,
    ippStsJPEGMarker = 10,
    ippStsResFloor = 11,
    ippStsOverflow = 12,
    ippStsLSFLow = 13,
    ippStsLSFHigh = 14,
    ippStsLSFLowAndHigh = 15,
    ippStsZeroOcc = 16,
    ippStsUnderflow = 17,
    ippStsSingularity = 18,
    ippStsDomain = 19,
    ippStsNonIntelCpu = 20,
    ippStsCpuMismatch = 21,
    ippStsNoIppFunctionFound = 22,
    ippStsDllNotFoundBestUsed = 23,
    ippStsNoOperationInDll = 24,
    ippStsInsufficientEntropy = 25,
    ippStsOvermuchStrings = 26,
    ippStsOverlongString = 27,
    ippStsAffineQuadChanged = 28,
    ippStsWrongIntersectROI = 29,
    ippStsWrongIntersectQuad = 30,
    ippStsSmallerCodebook = 31,
    ippStsSrcSizeLessExpected = 32,
    ippStsDstSizeLessExpected = 33,
    ippStsStreamEnd = 34,
    ippStsDoubleSize = 35,
    ippStsNotSupportedCpu = 36,
    ippStsUnknownCacheSize = 37,
    ippStsSymKernelExpected = 38,
    ippStsEvenMedianWeight = 39,
    ippStsWrongIntersectVOI = 40,
    ippStsI18nMsgCatalogInvalid = 41,
    ippStsI18nGetMessageFail = 42,
    ippStsWaterfall = 43,
    ippStsPrevLibraryUsed = 44,
    ippStsLLADisabled = 45,
    ippStsNoAntialiasing = 46,
    ippStsRepetitiveSrcData = 47,
    ippStsSizeWrn = 48,
    ippStsFeatureNotSupported = 49,
    ippStsUnknownFeature = 50,
    ippStsFeaturesCombination = 51,
    ippStsAccurateModeNotSupported = 52,
}
pub type IppSizeL = Ipp64s;

#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppiRectL {
    pub x: IppSizeL,
    pub y: IppSizeL,
    pub width: IppSizeL,
    pub height: IppSizeL,
}
#[test]
fn bindgen_test_layout_IppiRectL() {
    assert_eq!(::std::mem::size_of::<IppiRectL>() , 32usize , concat ! (
               "Size of: " , stringify ! ( IppiRectL ) ));
    assert_eq! (::std::mem::align_of::<IppiRectL>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( IppiRectL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiRectL ) ) . x as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiRectL ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiRectL ) ) . y as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiRectL ) , "::" ,
                stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiRectL ) ) . width as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiRectL ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiRectL ) ) . height as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiRectL ) , "::" ,
                stringify ! ( height ) ));
}
impl Clone for IppiRectL {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppiPointL {
    pub x: IppSizeL,
    pub y: IppSizeL,
}
#[test]
fn bindgen_test_layout_IppiPointL() {
    assert_eq!(::std::mem::size_of::<IppiPointL>() , 16usize , concat ! (
               "Size of: " , stringify ! ( IppiPointL ) ));
    assert_eq! (::std::mem::align_of::<IppiPointL>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( IppiPointL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiPointL ) ) . x as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiPointL ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiPointL ) ) . y as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiPointL ) , "::" ,
                stringify ! ( y ) ));
}
impl Clone for IppiPointL {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, PartialEq)]
pub struct IppiSizeL {
    pub width: IppSizeL,
    pub height: IppSizeL,
}
#[test]
fn bindgen_test_layout_IppiSizeL() {
    assert_eq!(::std::mem::size_of::<IppiSizeL>() , 16usize , concat ! (
               "Size of: " , stringify ! ( IppiSizeL ) ));
    assert_eq! (::std::mem::align_of::<IppiSizeL>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( IppiSizeL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiSizeL ) ) . width as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiSizeL ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IppiSizeL ) ) . height as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IppiSizeL ) , "::" ,
                stringify ! ( height ) ));
}
impl Clone for IppiSizeL {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IppiMorphMode { IPP_MORPH_DEFAULT = 0, IPP_MORPH_MASK_NO_FLIP = 1, }
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResizeSpec {
    _unused: [u8; 0],
}
pub type IppiResizeSpec = ResizeSpec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FilterBilateralType_LT {
